src/Catalogs/Кино.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Кино</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодОкончания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодIMDB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКинопоиск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСезонов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригинальноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКино</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Просмотрен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Жанры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Жанр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Жанры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СезонСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сезон</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыходаСерии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеСерии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотрена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Страны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/СохранениеВосстановлениеДанныхСервер/Ext/Module.bsl
Функция Сохранить() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Жанры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Жанры КАК Жанры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Страны.Ссылка
	|ИЗ
	|	Справочник.Страны КАК Страны
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Кино.Ссылка
	|ИЗ
	|	Справочник.Кино КАК Кино");
	Таб = Запрос.Выполнить().Выгрузить();
	МассивСправочниов = Новый Массив;
	Для каждого стр из Таб Цикл
		МассивСправочниов.Добавить(стр.Ссылка.ПолучитьОбъект());
	КонецЦикла;	
	
	Данные = Новый структура();
    Данные.Вставить("kinopoisk_unofficial_api_token",Константы.kinopoisk_unofficial_api_token.Получить());
	Данные.Вставить("ИспользуетсяЗаполнениеИзКинопоискаПоАПИ",Константы.ИспользуетсяЗаполнениеИзКинопоискаПоАПИ.Получить());
	Данные.Вставить("СтильОформления",Константы.СтильОформления.Получить());	
	Данные.Вставить("Справочники",МассивСправочниов);	
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Данные, НазначениеТипаXML.Явное);
	Текст =  ЗаписьJSON.Закрыть();
	
	Возврат Текст
	
КонецФункции

Процедура Восстановить(Текст, Лог = "") Экспорт
	
	УдалитьДанныеСправочников();
	
	ЧтениеJson = Новый ЧтениеJson;
	ЧтениеJson.УстановитьСтроку(Текст);
	Данные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJson);
	Если ТипЗНЧ(Данные) = Тип("Массив") Тогда // Оставлено для совместимости с первыми версиями приложения	
		Для каждого стр из Данные Цикл
			стр.Записать();
		КонецЦикла;
	ИначеЕсли ТипЗНЧ(Данные) = Тип("Структура") Тогда	
		Константы.kinopoisk_unofficial_api_token.Установить(Данные.kinopoisk_unofficial_api_token);
		Константы.ИспользуетсяЗаполнениеИзКинопоискаПоАПИ.Установить(Данные.ИспользуетсяЗаполнениеИзКинопоискаПоАПИ);
		Константы.СтильОформления.Установить(Данные.СтильОформления);
		
		Для каждого стр из Данные.Справочники Цикл
			стр.Записать();
		КонецЦикла;
	КонецЕсли;
	ЧтениеJson.Закрыть();
	
КонецПроцедуры

Процедура УдалитьДанныеСправочников()
	
	Выборка = Справочники.Жанры.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.Кино.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.Страны.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
КонецПроцедуры
